%набір фактів про відомих людей, що народилися 21.09
event(1452, ['Джироламо', 'Савонарола', 'флорентійський', 'поет', 'монах-домініканець', 'у', '1494', 'році', 'проголосив', 'Христа', 'королем', 'Флоренції']).
event(1784, ['Карл', 'Томас', 'Моцарт', 'австрійський', 'піаніст', 'син', 'композитора', 'Вольфганга', 'Амадея', 'Моцарта', 'і', 'його', 'дружини', 'Констанції', 'старший', 'брат', 'львівського', 'піаніста', 'диригента', 'і', 'композитора', 'Франца', 'Ксавера', 'Вольфганга', 'Моцарта']).
event(1866, ['Герберт', 'Веллс', 'англійський', 'письменник','Війна світів', 'Машина часу', 'Невидимець', 'Росія в імлі']).
event(1885, ['Томас', 'де Гартман', 'український', 'композитор', 'піаніст']).
event(1934, ['Леонард', 'Коен', 'канадський', 'поет', 'співак', 'і', 'автор', 'пісень', 'офіцер', 'та', 'компаньйон', 'Ордена', 'Канади']).
event(1938, ['Едуардо', 'Уркуло', 'іспанський', 'художник', 'і', 'скульптор']).
event(1944, ['Іван', 'Бяков', 'український', 'радянський', 'біатлоніст', 'дворазовий', 'олімпійський', 'чемпіон']).
event(1946,['Леонід', 'Кисельов', 'український', 'поет', 'російського', 'походження']).
event(1947, ['Стівен', 'Кінг', 'американський', 'письменник']).
event(1950, ['Білл', 'Мюррей', 'американський', 'актор', 'Труднощі перекладу', 'Зламані квіти', 'Кава й сигарети']).
event(1965, ['Валентин', 'Джима', 'український', 'біатлоніст', 'учасник', 'Олімпійських', 'ігор', '1994', 'батько', 'Олімпійської', 'чемпіонки', '2014', 'Юлії', 'Джими']).
event(1972, ['Ліам', 'Вільям Джон Пол', 'Галлахер', 'вокаліст', 'британського', 'гурту', 'Oasis']).


%Вивід:
%nl/0 – новий рядок
%tab/1 – додавання пропусків
%write/1 – вивід
%display/1 – вивід без обробки
%put/1 – посимвольне виведення
%
%?-write(a+b*c*c), nl, display(a+b*c*c)
%?-put(104),put(101),put(108),put(108),put(111)
speak(X):-write("Your number is:"), tab(1), write(X).

%Ввід:
%read/1 – зчитати терм
%readln/1 – зчитати строку
%get/1
%get0/1
%

test_list([H|T]):- write("head: "), write(H), nl, write("tail: "), write(T).

list_to_col(L) :- pp(L,0).

pp([H|T],I):-!,F is I+3, pp(H,F), ppx(T,F), nl.
pp(X,I) :- tab(I), write(X), nl.

ppx([],_).
ppx([H|T],I) :- pp(H,I), ppx(T,I).

%pp(X,I) :- not(list(X)), tab(I), write(X), nl.
%pp([H|T],I) :- J is I+3, pp(H,J), ppx(T,J), nl.
%
%list([]).
%list([_|_]).

print_event([]):- nl.
print_event([H|T]):- write(H), tab(1), print_event(T).


%?-event(_,L), member('поет',L), print_event(L)

% ?-print_event(['Яка',дата,вас,'цікавить?']),read(D),event(D,S),print_event(S)
%
%
%
%
%
%
%
%
%
%

print_str(S):-string_codes(S,L), print_list(L).
print_list([]).
print_list([H|Т]):- put(H), print_list(Т), consult(family).%change "family" to your file name.

%:- print_str([a,b,c]).


%?-print_string(«Чарлз V отрекся от престола в Брюсселе»)
%
%
%?- consult(family).
%?- reconsult(sum).
%?- [family, sum].
%
%
%?- nonvar(X).
%?- var(X).
%?- atom(a).
%?- integer(12).
%
% https://www.swi-prolog.org/pldoc/man?section=string-predicates


